性能脚本/大连压测实例-000031.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.1.1 r1855137">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP信息头管理器" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json;charset=utf-8</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV 数据文件设置" enabled="false">
        <stringProp name="delimiter">,</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="filename">D:/setting.txt</stringProp>
        <boolProp name="ignoreFirstLine">false</boolProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
        <boolProp name="stopThread">false</boolProp>
      </CSVDataSet>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="线程组" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">100</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">200</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <SyncTimer guiclass="TestBeanGUI" testclass="SyncTimer" testname="Synchronizing Timer" enabled="true">
          <intProp name="groupSize">200</intProp>
          <longProp name="timeoutInMs">1000</longProp>
        </SyncTimer>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Constant Throughput Timer" enabled="true">
          <intProp name="calcMode">1</intProp>
          <doubleProp>
            <name>throughput</name>
            <value>6000.0</value>
            <savedValue>0.0</savedValue>
          </doubleProp>
        </ConstantThroughputTimer>
        <hashTree/>
        <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname="BeanShell 预处理程序" enabled="true">
          <boolProp name="resetInterpreter">false</boolProp>
          <stringProp name="script">import java.lang.Integer;

Object threadNum = &quot;${__threadNum}&quot;;
Integer tnInt = Integer.parseInt(threadNum.toString());
Integer tnIntPlus = tnInt;
String currentAccount = &quot;jmeter_test_&quot;+tnIntPlus;
System.out.println(&quot;正在处理用户：&quot; + currentAccount);
vars.put(&quot;account&quot;, currentAccount);
</stringProp>
        </BeanShellPreProcessor>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="用户登录" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;username&quot;:&quot;${account}&quot;,&quot;password&quot;:&quot;MTIzNDU2&quot;,&quot;status&quot;:&quot;kick&quot;}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">127.0.0.1</stringProp>
          <stringProp name="HTTPSampler.port">8088</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">utf-8</stringProp>
          <stringProp name="HTTPSampler.path">/auth</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSONPathAssertion guiclass="JSONPathAssertionGui" testclass="JSONPathAssertion" testname="JSON断言" enabled="true">
            <stringProp name="JSON_PATH">$.userId</stringProp>
            <stringProp name="EXPECTED_VALUE">^\d+</stringProp>
            <boolProp name="JSONVALIDATION">true</boolProp>
            <boolProp name="EXPECT_NULL">false</boolProp>
            <boolProp name="INVERT">false</boolProp>
            <boolProp name="ISREGEX">true</boolProp>
          </JSONPathAssertion>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON提取器" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">token</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.token</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor" testname="BeanShell 后置处理程序" enabled="true">
            <boolProp name="resetInterpreter">false</boolProp>
            <stringProp name="script">System.out.println(vars.get(&quot;token&quot;));
</stringProp>
          </BeanShellPostProcessor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="获取用户信息" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">127.0.0.1</stringProp>
          <stringProp name="HTTPSampler.port">8088</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/user/v1/user/getByAccount?account=${account}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP信息头管理器" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${token}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <JSONPathAssertion guiclass="JSONPathAssertionGui" testclass="JSONPathAssertion" testname="JSON断言" enabled="true">
            <stringProp name="JSON_PATH">$.account</stringProp>
            <stringProp name="EXPECTED_VALUE">${account}</stringProp>
            <boolProp name="JSONVALIDATION">true</boolProp>
            <boolProp name="EXPECT_NULL">false</boolProp>
            <boolProp name="INVERT">false</boolProp>
            <boolProp name="ISREGEX">false</boolProp>
          </JSONPathAssertion>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON提取器" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">userId</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.userId</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON提取器" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">fullname</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.fullname</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="启动流程" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;data&quot;:&quot;eyJxeWpzQ2FzZU1vZGVsIjp7Inh4IjoiIiwiY2xsbCI6IjIzIiwia3pseCI6IiIsIm1mY2QiOiIiLCJvbndlYmVycm9yeXciOiIiLCJ6ZmRsIjoiIiwiZmFzZmYiOiIiLCJzZnRic2RqIjoiIiwiYmF0Y2hlcnJvcnl3IjoiIiwicXpybCI6IiIsImRsZHdlYmRsanFyZCI6IiIsImZhbnNmZiI6IiIsInl5ZGoiOiIiLCJxZGpzc2dzeXciOiIiLCJienpxIjoiIiwianNxcnl3IjoiIiwic3d0a2x4IjoiIiwiZmpiYmwiOiIiLCJxZGpzc3NncyI6IiIsIm1mU3RhcnRPdGhlckx4IjoiIiwiemwiOiIyIiwienNoeiI6IiIsImt6enRseCI6IiIsInliZmgiOiIiLCJ5anJwIjoiIiwiZGJ6c20iOiIiLCJmamp5IjoiIiwiemR6bXNtYWluIjoiIiwiZ2dremp4eSI6IiIsImNycXFzY2hlY2siOiIiLCJkajJobSI6IiIsImt6ZmwiOiIiLCJ6ZnIiOiI0NCIsInp6ZHlsIjoiMSIsInF4empzIjoiIiwiempmaiI6IiIsIm1xciI6IiIsInpkem1zIjoiIiwiZGpqc2dyb3VwY29tbWVudCI6IiIsImt6Z3JvdXBjb21tZW50IjoiIiwiZHpnbCI6IiIsImR6dGZ3IjoiIiwiemZqZXllbiI6IjMzIiwienF6ZngiOiIiLCJ4eGNoZWNrIjoiIiwiY3JzemN5IjoiIiwienF6emMiOiIiLCJqc2JsIjoiIiwiZnJxZnEiOiIiLCJkYXRhbXgiOiIiLCJkc2R6cXgiOiIiLCJ5eWRqaiI6IiIsImpzZnMiOiIiLCJ6ZmRsY2hlY2siOiIiLCJlcnJvcnh6d2wiOiIiLCJkbGRqc3l3IjoiIiwicXl6bSI6IiIsInpxc2QiOiIiLCJqc3p0IjoiIiwianNzY2hlY2siOiIiLCJmcnFmaCI6IiIsImRrZ3JvdXBjb21tZW50IjoiNCIsImRsZnMiOiIiLCJka2x4IjoiIiwianNqZXJyb3J5dyI6IiIsInN1Yl9jYXNlUGhvdG9NYXN0ZXIiOltdLCJzdWJfY2FzZVBob3RvU29uIjpbXSwiaW5pdERhdGEiOnsiY2FzZVBob3RvTWFzdGVyIjp7IkFQUExJQ0FOVF9OQU1FIjpudWxsLCJGUk9NX1RZUEUiOm51bGwsIkJFRl9IQU5ETEVfVU5LTk9XIjpudWxsLCJJU19MT0dPIjpudWxsLCJBUFBMSUNBTlRfS0FOQSI6bnVsbCwiREVMX0ZMQUdfIjpudWxsLCJCQVRDSF9DT1ZFUl9GTEFHIjpudWxsLCJCQVRDSF9DT1ZFUl9DT0RFIjpudWxsLCJQUk9DX0RFRl9OQU1FIjpudWxsLCJQUklNQVJZX1FSQ09ERSI6bnVsbCwiQ1JFQVRFX1RJTUVfIjpudWxsLCJCQVRDSF9EQVRFIjpudWxsLCJCQVRDSF9DT0RFIjpudWxsLCJPQ1JfSUQiOm51bGwsIlBSSU1BUllfREVTSUdOQVRJT04iOm51bGwsIlVQREFURV9USU1FXyI6bnVsbCwiUFJJTUFSWV9DT0RFIjpudWxsLCJCQVRDSF9DT1ZFUl9JRCI6bnVsbCwic3RhdGUiOm51bGwsIkNBVEVHT1JZX0NPREUiOm51bGwsIlpMX1RZUEUiOm51bGwsIkdFVF9EQVRFIjpudWxsLCJQUklNQVJZX0RFU0lHTkFUSU9OX1NVQiI6bnVsbCwiTUFJTl9UWVBFIjpudWxsLCJQUk9DX0RFRl9LRVkiOm51bGwsIk1BU1RFUl9JRCI6bnVsbCwiUFJPQ19JTlNUX0lEIjpudWxsLCJVUERBVEVfQllfIjpudWxsLCJDQVNFX05PIjpudWxsLCJERVBBUlRNRU5UX0NPREUiOm51bGwsIk1BSU5fTkFNRSI6bnVsbCwiU1RPUkVfQ09ERSI6bnVsbCwiRlJPTV9PUFRFUiI6bnVsbCwiU0NBTl9EQVRFIjpudWxsLCJDUkVBVEVfQllfIjpudWxsLCJQUklNQVJZX05BTUUiOm51bGwsIldPUktfQ0VOVEVSIjpudWxsfSwiY2FzZVBob3RvU29uIjp7IlBSSU5UX0FfU1RSSU5HIjpudWxsLCJQSE9UT19VUkwiOm51bGwsIm5vZGVOb1Nob3ciOm51bGwsIkNBUl9OTyI6bnVsbCwiQ0xBU1NfTlVNQkVSIjpudWxsLCJQUklOVEVEX05VTUJFUiI6bnVsbCwiTUFTVEVSX0lEIjpudWxsLCJJTUFHRV9ERVNJR05BVElPTl9TVUIiOm51bGwsIlFSX0NPREUiOm51bGwsIlVQREFURV9CWV8iOm51bGwsIlNUVUJfVFlQRSI6bnVsbCwiREVMX0ZMQUdfIjpudWxsLCJDQVNFX05PIjpudWxsLCJQSE9UT19OQU1FIjpudWxsLCJJTUFHRV9TQ0FOTklOR19EQVkiOm51bGwsIklNQUdFX0RFU0lHTkFUSU9OIjpudWxsLCJDUkVBVEVfVElNRV8iOm51bGwsIklOREVYX0NPREUiOm51bGwsIkRFRkFVTFRfVFlQRSI6bnVsbCwiQkxPQl9JRCI6bnVsbCwiVVBEQVRFX1RJTUVfIjpudWxsLCJDUkVBVEVfQllfIjpudWxsLCJNQUlOX1NVQl9GTEFHIjpudWxsfX19fQ==&quot;,&quot;defId&quot;: &quot;2493212&quot;,&quot;startOrgId&quot;: &quot;&quot;}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">127.0.0.1</stringProp>
          <stringProp name="HTTPSampler.port">8088</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">utf-8</stringProp>
          <stringProp name="HTTPSampler.path">/runtime/instance/v1/start</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP信息头管理器" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${token}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <JSONPathAssertion guiclass="JSONPathAssertionGui" testclass="JSONPathAssertion" testname="JSON断言" enabled="true">
            <stringProp name="JSON_PATH">$.state</stringProp>
            <stringProp name="EXPECTED_VALUE">true</stringProp>
            <boolProp name="JSONVALIDATION">true</boolProp>
            <boolProp name="EXPECT_NULL">false</boolProp>
            <boolProp name="INVERT">false</boolProp>
            <boolProp name="ISREGEX">false</boolProp>
          </JSONPathAssertion>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON提取器" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">instId</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.instId</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">0</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="获取待办任务" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;pageBean&quot;:{&quot;page&quot;:&quot;1&quot;,&quot;pageSize&quot;:&quot;1&quot;},&#xd;
  &quot;querys&quot;: [&#xd;
    {&#xd;
      &quot;operation&quot;: &quot;EQUAL&quot;,&#xd;
      &quot;property&quot;: &quot;tmp.proc_inst_id_&quot;,&#xd;
      &quot;relation&quot;: &quot;AND&quot;,&#xd;
      &quot;value&quot;: &quot;${instId}&quot;&#xd;
    }&#xd;
  ]}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">127.0.0.1</stringProp>
          <stringProp name="HTTPSampler.port">8088</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">utf-8</stringProp>
          <stringProp name="HTTPSampler.path">/runtime/task/v1/getTodoList</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP信息头管理器" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${token}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <JSONPathAssertion guiclass="JSONPathAssertionGui" testclass="JSONPathAssertion" testname="JSON断言" enabled="true">
            <stringProp name="JSON_PATH">$.total</stringProp>
            <stringProp name="EXPECTED_VALUE">^\d+</stringProp>
            <boolProp name="JSONVALIDATION">true</boolProp>
            <boolProp name="EXPECT_NULL">false</boolProp>
            <boolProp name="INVERT">false</boolProp>
            <boolProp name="ISREGEX">true</boolProp>
          </JSONPathAssertion>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON提取器" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">taskId</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.rows[0].taskId</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">0</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="待办审批" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;actionName&quot;:&quot;agree&quot;,&quot;taskId&quot;:&quot;${taskId}&quot;,&quot;opinion&quot;: &quot;同意&quot;,&quot;formType&quot;:&quot;inner&quot;}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">127.0.0.1</stringProp>
          <stringProp name="HTTPSampler.port">8088</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">utf-8</stringProp>
          <stringProp name="HTTPSampler.path">/runtime/task/v1/complete</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP信息头管理器" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${token}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <JSONPathAssertion guiclass="JSONPathAssertionGui" testclass="JSONPathAssertion" testname="JSON断言" enabled="true">
            <stringProp name="JSON_PATH">$.state</stringProp>
            <stringProp name="EXPECTED_VALUE">true</stringProp>
            <boolProp name="JSONVALIDATION">true</boolProp>
            <boolProp name="EXPECT_NULL">false</boolProp>
            <boolProp name="INVERT">false</boolProp>
            <boolProp name="ISREGEX">false</boolProp>
          </JSONPathAssertion>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="察看结果树" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">D:\工作\客户\旭辉\201911压测\旭辉x7压测测试用例.xml</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="聚合报告" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="图形结果" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <kg.apc.jmeter.perfmon.PerfMonCollector guiclass="kg.apc.jmeter.vizualizers.PerfMonGui" testclass="kg.apc.jmeter.perfmon.PerfMonCollector" testname="jp@gc - PerfMon Metrics Collector" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">D:\File_Download\测试用例.jmx</stringProp>
          <longProp name="interval_grouping">1000</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
          <collectionProp name="metricConnections">
            <collectionProp name="917712290">
              <stringProp name="-1204607085">localhost</stringProp>
              <stringProp name="1600768">4444</stringProp>
              <stringProp name="66952">CPU</stringProp>
            </collectionProp>
            <collectionProp name="-1383002031">
              <stringProp name="-1204607085">localhost</stringProp>
              <stringProp name="1600768">4444</stringProp>
              <stringProp name="-1993889503">Memory</stringProp>
            </collectionProp>
            <collectionProp name="506007220">
              <stringProp name="-1204607085">localhost</stringProp>
              <stringProp name="1600768">4444</stringProp>
              <stringProp name="2112896831">Disks I/O</stringProp>
            </collectionProp>
            <collectionProp name="-1270662015">
              <stringProp name="-1204607085">localhost</stringProp>
              <stringProp name="1600768">4444</stringProp>
              <stringProp name="-274342153">Network I/O</stringProp>
            </collectionProp>
          </collectionProp>
        </kg.apc.jmeter.perfmon.PerfMonCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>